#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/commerceprowess/notejam-infrastructure/runs/run-jE42R6cMNogsFKph

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
azurerm_resource_group.prod_rg: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg]
module.notejam-sqldb-georeplicated.azurerm_sql_server.secondary: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.Sql/servers/notejam-sqlserver-secondary]
module.notejam-sqldb-georeplicated.azurerm_sql_server.primary: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.Sql/servers/notejam-sqlserver-primary]
module.notejam-acr-production-georeplicated.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.ContainerRegistry/registries/notejamprod]
module.notejam-sqldb-georeplicated.azurerm_sql_database.db: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.Sql/servers/notejam-sqlserver-primary/databases/notejam-db]
module.notejam-sqldb-georeplicated.azurerm_sql_failover_group.fg: Refreshing state... [id=/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.Sql/servers/notejam-sqlserver-primary/failoverGroups/notejam-dbfg]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.notejam-acr-production-georeplicated.azurerm_container_registry.acr has changed
  ~ resource "azurerm_container_registry" "acr" {
      ~ georeplications               = [
          ~ {
              ~ tags                      = null -> {}
                # (3 unchanged elements hidden)
            },
        ]
        id                            = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.ContainerRegistry/registries/notejamprod"
        name                          = "notejamprod"
      + tags                          = {}
        # (16 unchanged attributes hidden)
    }

  # module.notejam-sqldb-georeplicated.azurerm_sql_database.db has changed
  ~ resource "azurerm_sql_database" "db" {
        id                               = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.Sql/servers/notejam-sqlserver-primary/databases/notejam-db"
        name                             = "notejam-db"
      + tags                             = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.notejam-sqldb-georeplicated.azurerm_sql_failover_group.fg has changed
  ~ resource "azurerm_sql_failover_group" "fg" {
        id                  = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.Sql/servers/notejam-sqlserver-primary/failoverGroups/notejam-dbfg"
        name                = "notejam-dbfg"
      + tags                = {}
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.notejam-sqldb-georeplicated.azurerm_sql_server.primary has changed
  ~ resource "azurerm_sql_server" "primary" {
        id                           = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.Sql/servers/notejam-sqlserver-primary"
        name                         = "notejam-sqlserver-primary"
      + tags                         = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.notejam-sqldb-georeplicated.azurerm_sql_server.secondary has changed
  ~ resource "azurerm_sql_server" "secondary" {
        id                           = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.Sql/servers/notejam-sqlserver-secondary"
        name                         = "notejam-sqlserver-secondary"
      + tags                         = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.notejam-infra-production-primary.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + dns_prefix                          = "notejam-k8s-prod-westeurope"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "westeurope"
      + name                                = "notejam-k8s-prod-westeurope"
      + node_resource_group                 = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "notejam-prod-rg"
      + sku_tier                            = "Free"
      + tags                                = {
          + "Environment" = "production"
        }

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_keyvault_secrets_provider {
              + enabled                  = (known after apply)
              + secret_identity          = (known after apply)
              + secret_rotation_enabled  = (known after apply)
              + secret_rotation_interval = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }

          + open_service_mesh {
              + enabled = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + availability_zones   = [
              + "1",
              + "2",
              + "3",
            ]
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + name                 = "prdwesteur"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "Standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # module.notejam-infra-production-primary.azurerm_role_assignment.acrpull will be created
  + resource "azurerm_role_assignment" "acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.ContainerRegistry/registries/notejamprod"
      + skip_service_principal_aad_check = true
    }

  # module.notejam-k8s-production-secondary.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + dns_prefix                          = "notejam-k8s-prod-northeurope"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "northeurope"
      + name                                = "notejam-k8s-prod-northeurope"
      + node_resource_group                 = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "notejam-prod-rg"
      + sku_tier                            = "Free"
      + tags                                = {
          + "Environment" = "production"
        }

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_keyvault_secrets_provider {
              + enabled                  = (known after apply)
              + secret_identity          = (known after apply)
              + secret_rotation_enabled  = (known after apply)
              + secret_rotation_interval = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }

          + open_service_mesh {
              + enabled = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + availability_zones   = [
              + "1",
              + "2",
              + "3",
            ]
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + name                 = "prdnortheur"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "Standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # module.notejam-k8s-production-secondary.azurerm_role_assignment.acrpull will be created
  + resource "azurerm_role_assignment" "acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/1dfa3ab0-d7c3-40ca-9db1-41c3a35266e7/resourceGroups/notejam-prod-rg/providers/Microsoft.ContainerRegistry/registries/notejamprod"
      + skip_service_principal_aad_check = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @marouanabbessi, Action: `pull_request`*